PureEngineering/PUREmodules/nrf52/modules_examples/ble_app_uart/main.c
uint8_t ORIENTATION_X = 0;
uint8_t ORIENTATION_Y = 1;
uint8_t ORIENTATION_Z = 2;

bool did_sign_change(int value, int prev_value){
    if (value >= 0){
        return prev_value < 0;
    }
    else{
        return prev_value >= 0;
    }
}


uint8_t check_orientation(int x_cycle_count, int y_cycle_count, int z_cycle_count){
    if(x_cycle_count>=y_cycle_count){
        if(x_cycle_count>=z_cycle_count){
            return ORIENTATION_X;
        }
        else{
            return ORIENTATION_Z;
        }
    }
    else{
        if(y_cycle_count>=z_cycle_count){
            return ORIENTATION_Y;
        }
        else{
            return ORIENTATION_Z;
        }
    }
}

int step_incrementer(int step_count, uint8_t current_orientation, bool x_changed, bool y_changed,bool z_changed){

    if(current_orientation==ORIENTATION_X){
        if(x_changed){
            bsp_board_led_invert(0);
            return step_count + 1;
        }
        else{
            return step_count;
        }
    }
    else if(current_orientation==ORIENTATION_Y){
        if(y_changed){
            bsp_board_led_invert(0);
            return step_count + 1;
        }
        else{
            return step_count;
        }
    }
    else{
        if(z_changed){
            bsp_board_led_invert(0);
            return step_count + 1;
        }
        else{
            return step_count;
        }
    }
}



void lis2de_stepcounter(){
    //uint8_t debug_counter = 0;
    int counter = 0;

    int x_cycle_count = 0;
    int y_cycle_count = 0;
    int z_cycle_count = 0;

    int8_t prev_outx = 0;
    int8_t prev_outy = 0;
    int8_t prev_outz = 0;

    bool x_changed = 0; 
    bool y_changed = 0;
    bool z_changed = 0;

    uint8_t current_orientation = 0;

    int step_count = 0;

    //uint8_t length = 1;
    //uint8_t data_array[length];

    while(1){

    //debug_counter++;
    counter++;

    int8_t outx =  lis2de_readOUT_X(m_twi_master);
    int8_t outy =  lis2de_readOUT_Y(m_twi_master);
    int8_t outz =  lis2de_readOUT_Z(m_twi_master);



    current_orientation = check_orientation(x_cycle_count,y_cycle_count,z_cycle_count);

    if(did_sign_change(outx, prev_outx)){
        x_changed = 1;
        x_cycle_count++;
    }
    else{
        x_changed = 0;
    }
    if(did_sign_change(outy, prev_outy)){
        y_changed = 1;
        y_cycle_count++;
    }
    else{
        y_changed = 0;
    }
    if(did_sign_change(outz, prev_outz)){
        z_changed = 1;
        z_cycle_count++;
    }
    else{
        z_changed = 0;
    }

    step_count = step_incrementer(step_count, current_orientation, x_changed, y_changed, z_changed);



    prev_outx = outx;
    prev_outy = outy;
    prev_outz = outz;

    //NRF_LOG_RAW_INFO("-----------------------");
    NRF_LOG_RAW_INFO("STEP Count : %x.\r\n\r\n", step_count);
    //NRF_LOG_RAW_INFO("Orientation: %x.\r\n", current_orientation);
    //NRF_LOG_RAW_INFO("X cycle    : %x.\r\n", x_cycle_count);
    //NRF_LOG_RAW_INFO("Y cycle    : %x.\r\n", y_cycle_count);
    //NRF_LOG_RAW_INFO("Z cycle    : %x.\r\n", z_cycle_count);

    if(counter == 25){
        char step_count_string[20];
        sprintf(step_count_string,"Step Count = %d",step_count);
        puts(step_count_string);
        //data_array[0] = step_count_string;
        printf("\r\n Step Count: %d \r\n",step_count);

        //send_ble_data(step_count_string,20);
        counter = 0;
    }

    nrf_delay_ms(100);
    NRF_LOG_FLUSH();
    }
}



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
    
    //Parses the input from the android app to turn on or off
    //the different sensors. 

    if(p_data[0]=='1'){
        lis2de_init(m_twi_master);
        lis2de_on = true;
    }
    if(p_data[0]=='2'){
        lis2de_powerdown(m_twi_master);
        lis2de_on = false;
    }
    if(p_data[0]=='3'){
        lis3mdl_init(m_twi_master);
        lis3mdl_on = true;
    }
    if(p_data[0]=='4'){
        lis3mdl_powerdown(m_twi_master);
        lis3mdl_on = false;
    }
    if(p_data[0]=='5'){
        bme280_init(m_twi_master);
        bme280_on = true;
    }
    if(p_data[0]=='6'){
        bme280_powerdown(m_twi_master);
        bme280_on = false;
    }
    if(p_data[0]=='7'){
        veml6075_init(m_twi_master);
        veml6075_on = true;
    }
    if(p_data[0]=='8'){
        veml6075_powerdown(m_twi_master);
        veml6075_on = false;
    }
    if(p_data[0]=='9'){
        si1153_init(m_twi_master);
        si1153_on = true;
    }
    if(p_data[0]=='a'){
        //Si1153 automatically moves to Standby Mode
        si1153_on = false;
    }

    //Code to put ble received messages into uart

    /*for (uint32_t i = 0; i < length; i++)
    {       
        while (app_uart_put(p_data[i]) != NRF_SUCCESS);
    }
    while (app_uart_put('\r') != NRF_SUCCESS);
    while (app_uart_put('\n') != NRF_SUCCESS);*/

